Repository: tdyushaxa/pdf_again
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, tr, uz

# hello
source: <b>Hello</b> welcome to bot
ru: <b>Привет</b>, добро пожаловать в бот
tr: <b>Merhaba</b> bot'a hoş geldiniz
uz: <b>Assalomu aleykum</b> botga xush kelibsiz

# change_lang
source: Language selected.
ru: Выбран язык.
tr: Dil seçildi.
uz: Til tanladni.

# choose
source: Choose language.
ru: Выберите язык.
tr: <b>Dil seçin. </b>
uz: <b>Tilni tanlang. </b>

# image_pdf
source: 📸 Send a picture and I will convert it to PDF
ru: 📸 Пришлите картинку и я конвертирую ее в PDF
tr: 📸 Bir resim gönder, ben onu PDF'ye dönüştüreyim
uz: 📸 Rasm yuboring, men uni PDF formatiga aylantiraman

# recive__pic_state
source: The bot currently only accepts 📸 images!!!
ru: В настоящее время бот принимает только 📸 изображений!!!
tr: Bot şu anda yalnızca 📸 Fotoğraf kabul ediyor!!!
uz: Bot hozirgi holatida faqat 📸 rasm qabul qiladi!!!

# recive_pic_agree
source: ✅ Image received...
ru: ✅ Изображение получено...
tr: ✅ Fotoğraf alındı...
uz: ✅ Rasm qabul qilindi...

# quality_pic_check
source: 🚫 Check the picture quality !!!
ru: 🚫 Проверьте качество картинки!!!
tr: 🚫 Resim kalitesini kontrol edin !!!
uz: 🚫 Rasm sifatini tekshiring !!!

# pic_get_text_state
source: The text of any picture 📸 will be given to you instantly...
ru: Текст любой картинки 📸 будет передан вам мгновенно...
tr: İstediğiniz resmin metnini size anında vereceğim 📸...
uz: Sizga istalgan rasmning 📸 textni bir zumda olib beraman...

# send_pic
source: 📸 Send a picture...
ru: 📸 Отправьте фото...
tr: 📸 Bir resim gönder...
uz: 📸 Rasm yuboring ...

# back
source: Come back
ru: Возвращаться
tr: Geri gitmek
uz: Ortga qaytish

# excel_file
source: 📃 <b>Send Excel file...</b>
ru: 📃 <b>Отправить файл Excel...</b>
tr: 📃 <b>Excel dosyasını gönder...</b>
uz: 📃 <b>Excel file yuboring...</b>

# recive_excel_agree
source: 👌 File received
ru: 👌Файл получен
tr: 👌 Dosya alındı
uz: 👌 File qabul qilindi

# excel_errors
source: 🚫 <b>Only Excel .xlsx, .xls format files are accepted</b>
ru: 🚫 <b>Принимаются только файлы формата Excel .xlsx, .xls</b>
tr: 🚫 <b>Yalnızca Excel .xlsx, .xls biçimindeki dosyalar kabul edilir</b>
uz: 🚫 <b>Faqat Excel .xlsx, .xls formatdagi filelar qabul qilinadi</b>

# again_recive_excel_state
source: 📃 Send Excel file
ru: 📃 Отправить файл Excel
tr: 📃 Excel dosyasını gönder
uz: 📃 Excel file yuboring

# excel_file_errors
source: 🙅‍♂️ An error occurred, try again with the file
ru: 🙅‍♂️ Произошла ошибка, попробуйте еще раз с файлом
tr: 🙅‍♂️ Bir hata oluştu, dosyayla tekrar deneyin
uz: 🙅‍♂️ Xatolik yuz berdi file bilan qaytadan urunib ko'ring

# word_file
source: 📁 Send a Word file...
ru: 📁 Отправьте файл Word...
tr: 📁 Bir Word dosyası gönderin...
uz: 📁 Word file yuboring...

# word_file_recive_state
source: The bot currently accepts only 📁 Document!
ru: На данный момент бот принимает только 📁 Документ!
tr: Bot şu anda yalnızca 📁 Belgeyi kabul ediyor!
uz: Bot hozirgi holatida faqat 📁 Document qabul qiladi !

# word_file_recive_agree
source: ✅ File received
ru: ✅ Файл получен
tr: ✅ Dosya alındı
uz: ✅ File qabul qilindi

# word_file_errors
source: 🙅‍ ️Only word files are accepted!!!
ru: 🙅‍ ️Принимаются только текстовые файлы!!!
tr: 🙅‍ ️Yalnızca word dosyaları kabul edilmektedir!!!
uz: 🙅‍ ️Faqat word filelar qabul qilinadi!!!

# word_file_again
source: 📁 Send a Word file
ru: 📁 Отправьте файл Word
tr: 📁 Bir Word dosyası gönder
uz: 📁 Word file yuboring

# word_file_change
source: ✏️ Word file PDF is changing! Wait a minute...
ru: ✏️ Файл Word PDF меняется! Подождите минуту...
tr: ✏️ Word dosyası PDF'si değişiyor! Bir dakika bekle...
uz: ✏️ Word file PDF o'zgarmoqda! Biroz kuting...

# word_file_changed
source: ✏️ The file has been changed!!!
ru: ✏️Файл изменен!!!
tr: ✏️Dosya değiştirildi!!!
uz: ✏️ File o'zgartirldi!!!

# word_file_errors_file
source: 🚫 An error occurred. Word file may be encrypted!!!!
ru: 🚫 Произошла ошибка. Файл Word может быть зашифрован!!!
tr: 🚫 Bir hata oluştu. Word dosyası şifrelenmiş olabilir!!!
uz: 🚫 Xatolik yuz berdi. Word file shifrlangan bo'lishi mumkin!!!

# pdf_get_image
source: <b>📃 Send a PDF file! I will get you the pictures from the PDF file.</b>
ru: <b>📃 Отправьте PDF-файл! Я принесу вам фотографии из PDF-файла.</b>
tr: <b>📃 Bir PDF dosyası gönderin! Size PDF dosyasındaki resimleri getireceğim.</b>
uz: <b>📃 PDF file yuboring! Men sizga PDF filedan rasmlarni olib beraman.</b>

# pdf_get_image_state
source: The bot currently only accepts 📃 PDF!!!
ru: На данный момент бот принимает только 📃 PDF!!!
tr: Bot şu anda yalnızca 📃 PDF'yi kabul ediyor!!!
uz: Bot hozirgi holatida faqat 📃 PDF qabul qiladi!!!

# pdf_get_image_recieve
source: ✅ File received
ru: ✅ Файл получен
tr: ✅ Dosya alındı
uz: ✅ File qabul qilindi

# pdf_get_image_errors
source: 🙅‍ ️Only PDF files are accepted!!!
ru: 🙅‍ ️Принимаются только PDF файлы!!!
tr: 🙅‍ ️Yalnızca PDF dosyaları kabul edilir!!!
uz: 🙅‍ ️Faqat PDF filelar qabul qilinadi!!!

# pdf_get_image_again_state
source: 📁 Send a PDF file
ru: 📁 Отправьте PDF-файл
tr: 📁 Bir PDF dosyası gönder
uz: 📁 PDF file yuboring

# pdf_get_image_file_errors
source: <b>🚫 FIle size is large or there is a problem with File!!</b>
ru: <b>🚫 Размер файла большой или с файлом возникла проблема!!</b>
tr: <b>🚫Dosya boyutu büyük veya Dosyada bir sorun var!!</b>
uz: <b>🚫 FIle hajmi katta yoki File bilan muammo bor!!</b>

# pdf_get_image_file_sending
source: ✏️ Downloading pictures! Wait a minute...
ru: ✏️ Скачиваем картинки! Подождите минуту...
tr: ✏️Resimler indiriliyor! Bir dakika bekle...
uz: ✏️ Rasmlarni yuklab olinmoqda! Biroz kuting...

# pdf_get_image_file_send
source: 📷 Photos sent
ru: 📷 Фотографии отправлены
tr: 📷 Fotoğraflar gönderildi
uz: 📷 Rasmlar jo'natildi

# pdf_file
source: 📃 <b>Send pdf file...</b>
ru: 📃 <b>Отправить PDF-файл...</b>
tr: 📃 <b>Pdf dosyasını gönder...</b>
uz: 📃 <b>Pdf file yuboring...</b>

# pdf_file_state
source: The bot currently accepts only 📃 Document!
ru: На данный момент бот принимает только 📃 Документ!
tr: Bot şu anda yalnızca 📃 Belgeyi kabul ediyor!
uz: Bot hozirgi holatida faqat 📃 Document qabul qiladi !

# pdf_file_agree
source: 👌 File received
ru: 👌Файл получен
tr: 👌 Dosya alındı
uz: 👌 File qabul qilindi

# pdf_files_errors
source: 🚫 <b>Only PDF files are accepted</b>
ru: 🚫 <b>Принимаются только файлы PDF</b>
tr: 🚫 <b>Yalnızca PDF dosyaları kabul edilir</b>
uz: 🚫 <b>Faqat PDF filelar qabul qilinadi</b>

# pdf_file_state_again
source: 📃 Send a pdf file
ru: 📃 Отправьте PDF-файл
tr: 📃 Bir pdf dosyası gönder
uz: 📃 Pdf file yuboring

# pdf_file_changing
source: ✏️ PDF file is changing to WORD! Wait a minute...
ru: ✏️ PDF-файл меняется на WORD! Подождите минуту...
tr: ✏️PDF dosyası WORD olarak değişiyor! Bir dakika bekle...
uz: ✏️ PDF file WORD o'zgarmoqda! Biroz kuting...

# pdf_file_changing_wait
source: 📃 Depending on the file size. The wait can be between 1 - 5 minutes...
ru: 📃 В зависимости от размера файла. Ожидание может занять от 1 до 5 минут...
tr: 📃Dosya boyutuna bağlı olarak. Bekleme süresi 1 ila 5 dakika arasında olabilir...
uz: 📃 File Hajmiga qarab. Kutish 1 - 5 daqiqa oralig'ida bo'lishi mumkin...

# pdf_file_changed
source: ✅ The file has been changed!!!
ru: ✅ Файл изменен!!!
tr: ✅ Dosya değiştirildi!!!
uz: ✅ File o'zgartirldi!!!

# pdf_file_change_error
source: 🙅‍♂️ An error occurred, try again with the file
ru: 🙅‍♂️ Произошла ошибка, попробуйте еще раз с файлом
tr: 🙅‍♂️ Bir hata oluştu, dosyayla tekrar deneyin
uz: 🙅‍♂️ Xatolik yuz berdi file bilan qaytadan urunib ko'ring

# channel_membership
source: Subscribe to the following channels:
ru: Подпишитесь на следующие каналы:
tr: Aşağıdaki kanallara abone olun:
uz: Quyidagi kanallarga obuna bo'ling:

# channel_membership_enter
source: You have subscribed to the channel!
ru: Вы подписались на канал!
tr: Kanala abone oldunuz!
uz: kanaliga obuna bo'lgansiz!

# membership
source: subscribe
ru: подписаться
tr: abone ol
uz: Obuna bo'ling

# membership_close
source: You have not subscribed to the channel.
ru: Вы не подписаны на канал.
tr: Kanala abone olmadınız.
uz: kanaliga obuna bo'lmagansiz.
